mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define ADC0CF1_RPCE__BMASK    0x40 ///< Reference Pin Connection Enable                
#define ADC0CF1_RPCE__SHIFT    0x06 ///< Reference Pin Connection Enable                
#define ADC0CF1_RPCE__DISABLED 0x00 ///< Disable external voltage reference for the ADC.
#define ADC0CF1_RPCE__ENABLED  0x40 ///< Enable external voltage reference for the ADC. 
                                                                                        
//------------------------------------------------------------------------------
// ADC0CF2 Enums (ADC0 Power Control @ 0xDF)
//------------------------------------------------------------------------------
#define ADC0CF2_ADPWR__FMASK      0x0F ///< Power Up Delay Time                              
#define ADC0CF2_ADPWR__SHIFT      0x00 ///< Power Up Delay Time                              
                                                                                             
#define ADC0CF2_REFSL__FMASK      0x70 ///< Voltage Reference Select                         
#define ADC0CF2_REFSL__SHIFT      0x04 ///< Voltage Reference Select                         
#define ADC0CF2_REFSL__1V2        0x00 ///< Selects 1.2V from internal fast reference as the 
                                       ///< ADC0 voltage reference.                          
#define ADC0CF2_REFSL__1V4        0x10 ///< Selects 1.4V from internal fast reference as the 
                                       ///< ADC0 voltage reference.                          
#define ADC0CF2_REFSL__1V65       0x20 ///< Selects 1.65V from internal fast reference as the
                                       ///< ADC0 voltage reference.                          
#define ADC0CF2_REFSL__1V8        0x30 ///< Selects 1.8V from internal fast reference as the 
                                       ///< ADC0 voltage reference.                          
#define ADC0CF2_REFSL__VDD_RANGE1 0x40 ///< Selects VDD_RANGE1 voltage as the ADC0 voltage   
                                       ///< reference when VDD is between 3.4-5.5V.          
#define ADC0CF2_REFSL__VDD_RANGE2 0x50 ///< Selects VDD_RANGE2 voltage as the ADC0 voltage   
                                       ///< reference when VDD is between 2.3-3.7V.          
#define ADC0CF2_REFSL__VDD_RANGE3 0x60 ///< Selects VDD_RANGE3 voltage as the ADC0 voltage   
                                       ///< reference when VDD is between 1.7-2.9V.          
#define ADC0CF2_REFSL__EXTREF     0x70 ///< Selects the VREF pin as the ADC0 voltage         
                                       ///< reference.                                       
                                                                                             
#define ADC0CF2_GNDSL__BMASK      0x80 ///< Analog Ground Reference                          
#define ADC0CF2_GNDSL__SHIFT      0x07 ///< Analog Ground Reference                          
#define ADC0CF2_GNDSL__GND_PIN    0x00 ///< The ADC0 ground reference is internal ground.    
#define ADC0CF2_GNDSL__AGND_PIN   0x80 ///< The ADC0 ground reference is the external analog 
                                       ///< ground pin.                                      
                                                                                             
//------------------------------------------------------------------------------
// ADC0CN0 Enums (ADC0 Control 0 @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN0_TEMPE__BMASK         0x01 ///< Temperature Sensor Enable                         
#define ADC0CN0_TEMPE__SHIFT         0x00 ///< Temperature Sensor Enable                         
#define ADC0CN0_TEMPE__TEMP_DISABLED 0x00 ///< Disable the Temperature Sensor.                   
#define ADC0CN0_TEMPE__TEMP_ENABLED  0x01 ///< Enable the Temperature Sensor.                    
                                                                                                 
#define ADC0CN0_ADGN__FMASK          0x06 ///< Gain Control                                      
#define ADC0CN0_ADGN__SHIFT          0x01 ///< Gain Control                                      
#define ADC0CN0_ADGN__GAIN_1         0x00 ///< The on-chip gain is 1.                            
#define ADC0CN0_ADGN__GAIN_0P75      0x02 ///< The on-chip gain is 0.75.                         
#define ADC0CN0_ADGN__GAIN_0P5       0x04 ///< The on-chip gain is 0.5.                          
#define ADC0CN0_ADGN__GAIN_0P25      0x06 ///< The on-chip gain is 0.25.                         
                                                                                                 
#define ADC0CN0_ADWINT__BMASK        0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN0_ADWINT__SHIFT        0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN0_ADWINT__NOT_SET      0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN0_ADWINT__SET          0x08 ///< An ADC window compare event occurred.             
                                                                                                 
#define ADC0CN0_ADBUSY__BMASK        0x10 ///< ADC Busy                                          
#define ADC0CN0_ADBUSY__SHIFT        0x04 ///< ADC Busy                                          
#define ADC0CN0_ADBUSY__NOT_SET      0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN0_ADBUSY__SET          0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                          ///< conversion.                                       
                                                                                                 
#define ADC0CN0_ADINT__BMASK         0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN0_ADINT__SHIFT         0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN0_ADINT__NOT_SET       0x00 ///< ADC0 has not completed a conversion since the last
                                          ///< time ADINT was cleared.                           
#define ADC0CN0_ADINT__SET           0x20 ///< ADC0 completed a data conversion.                 
                                                                                                 
