mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define ADC0CN0_IPOEN__BMASK         0x40 ///< Idle Powered-off Enable                           
#define ADC0CN0_IPOEN__SHIFT         0x06 ///< Idle Powered-off Enable                           
#define ADC0CN0_IPOEN__ALWAYS_ON     0x00 ///< Keep ADC powered on when ADEN is 1.               
#define ADC0CN0_IPOEN__POWER_DOWN    0x40 ///< Power down when ADC is idle (not converting).     
                                                                                                 
#define ADC0CN0_ADEN__BMASK          0x80 ///< ADC Enable                                        
#define ADC0CN0_ADEN__SHIFT          0x07 ///< ADC Enable                                        
#define ADC0CN0_ADEN__DISABLED       0x00 ///< Disable ADC0.                                     
#define ADC0CN0_ADEN__ENABLED        0x80 ///< Enable ADC0 (active and ready for data            
                                          ///< conversions).                                     
                                                                                                 
//------------------------------------------------------------------------------
// ADC0CN1 Enums (ADC0 Control 1 @ 0xB2)
//------------------------------------------------------------------------------
#define ADC0CN1_ADRPT__FMASK           0x07 ///< Repeat Count                               
#define ADC0CN1_ADRPT__SHIFT           0x00 ///< Repeat Count                               
#define ADC0CN1_ADRPT__ACC_1           0x00 ///< Perform and Accumulate 1 conversion.       
#define ADC0CN1_ADRPT__ACC_4           0x01 ///< Perform and Accumulate 4 conversions.      
#define ADC0CN1_ADRPT__ACC_8           0x02 ///< Perform and Accumulate 8 conversions.      
#define ADC0CN1_ADRPT__ACC_16          0x03 ///< Perform and Accumulate 16 conversions.     
#define ADC0CN1_ADRPT__ACC_32          0x04 ///< Perform and Accumulate 32 conversions.     
                                                                                            
#define ADC0CN1_ADSJST__FMASK          0x18 ///< Accumulator Shift and Justify              
#define ADC0CN1_ADSJST__SHIFT          0x03 ///< Accumulator Shift and Justify              
#define ADC0CN1_ADSJST__RIGHT_NO_SHIFT 0x00 ///< Right justified. No shifting applied.      
#define ADC0CN1_ADSJST__RIGHT_SHIFT_1  0x08 ///< Right justified. Shifted right by 1 bit.   
#define ADC0CN1_ADSJST__RIGHT_SHIFT_2  0x10 ///< Right justified. Shifted right by 2 bits.  
#define ADC0CN1_ADSJST__RIGHT_SHIFT_3  0x18 ///< Right justified. Shifted right by 3 bits.  
                                                                                            
#define ADC0CN1_ADBITS__FMASK          0x60 ///< Resolution Control                         
#define ADC0CN1_ADBITS__SHIFT          0x05 ///< Resolution Control                         
#define ADC0CN1_ADBITS__12_BIT         0x00 ///< ADC0 operates in 12-bit mode.              
#define ADC0CN1_ADBITS__10_BIT         0x20 ///< ADC0 operates in 10-bit mode.              
#define ADC0CN1_ADBITS__8_BIT          0x40 ///< ADC0 operates in 8-bit mode.               
                                                                                            
#define ADC0CN1_POWERUP__BMASK         0x80 ///< Power up status                            
#define ADC0CN1_POWERUP__SHIFT         0x07 ///< Power up status                            
#define ADC0CN1_POWERUP__COMPLETE      0x00 ///< Power up is complete or ADC not in power up
                                            ///< sequence.                                  
#define ADC0CN1_POWERUP__IN_PROGRESS   0x80 ///< Power up is in progress.                   
                                                                                            
//------------------------------------------------------------------------------
// ADC0CN2 Enums (ADC0 Control 2 @ 0xB3)
//------------------------------------------------------------------------------
#define ADC0CN2_ADCM__FMASK         0x0F ///< Start of Conversion Mode Select                   
#define ADC0CN2_ADCM__SHIFT         0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN2_ADCM__ADBUSY        0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN2_ADCM__TIMER0        0x01 ///< ADC0 conversion initiated on overflow of Timer 0. 
#define ADC0CN2_ADCM__TIMER2        0x02 ///< ADC0 conversion initiated on overflow of Timer 2. 
#define ADC0CN2_ADCM__TIMER3        0x03 ///< ADC0 conversion initiated on overflow of Timer 3. 
#define ADC0CN2_ADCM__RESERVED      0x04 ///<                                                   
#define ADC0CN2_ADCM__CEX2          0x05 ///< ADC0 conversion initiated on rising edge of CEX2. 
#define ADC0CN2_ADCM__TIMER4        0x06 ///< ADC0 conversion initiated on overflow of Timer 4. 
#define ADC0CN2_ADCM__TIMER5        0x07 ///< ADC0 conversion initiated on overflow of Timer 5. 
#define ADC0CN2_ADCM__CLU0          0x08 ///< ADC0 conversion initiated on CLU0 Output.         
#define ADC0CN2_ADCM__CLU1          0x09 ///< ADC0 conversion initiated on CLU1 Output.         
#define ADC0CN2_ADCM__CLU2          0x0A ///< ADC0 conversion initiated on CLU2 Output.         
#define ADC0CN2_ADCM__CLU3          0x0B ///< ADC0 conversion initiated on CLU3 Output.         
                                                                                                
#define ADC0CN2_VDDDIV_INP__BMASK   0x10 ///< VDD_DIV input select                              
#define ADC0CN2_VDDDIV_INP__SHIFT   0x04 ///< VDD_DIV input select                              
#define ADC0CN2_VDDDIV_INP__GND     0x00 ///< GND is selected as the ADC input.                 
#define ADC0CN2_VDDDIV_INP__VDD_DIV 0x10 ///< VDD_DIV is selected as the ADC input.             
                                                                                                
#define ADC0CN2_PACEN__BMASK        0x80 ///< Preserve Accumulator Enable                       
#define ADC0CN2_PACEN__SHIFT        0x07 ///< Preserve Accumulator Enable                       
#define ADC0CN2_PACEN__PAC_DISABLED 0x00 ///< The ADC accumulator is over-written with the      
                                         ///< results of any conversion (or set of conversions  
                                         ///< as specified by ADRPT).                           
#define ADC0CN2_PACEN__PAC_ENABLED  0x80 ///< The ADC accumulator always adds new results to the
                                         ///< existing output. The accumulator is never cleared 
                                         ///< in this mode.                                     
                                                                                                
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x1F ///< AMUX0 Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX0 Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select ADC0.0.       
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select ADC0.1.       
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select ADC0.2.       
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select ADC0.3.       
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select ADC0.4.       
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select ADC0.5.       
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select ADC0.6.       
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select ADC0.7.       
#define ADC0MX_ADC0MX__ADC0P8  0x08 ///< Select ADC0.8.       
#define ADC0MX_ADC0MX__ADC0P9  0x09 ///< Select ADC0.9.       
#define ADC0MX_ADC0MX__ADC0P10 0x0A ///< Select ADC0.10.      
#define ADC0MX_ADC0MX__ADC0P11 0x0B ///< Select ADC0.11.      
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select ADC0.12.      
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select ADC0.13.      
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select ADC0.14.      
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select ADC0.15.      
#define ADC0MX_ADC0MX__TEMP    0x10 ///< Select ADC0.16.      
#define ADC0MX_ADC0MX__VDD_DIV 0x11 ///< Select ADC0.17.      
                                                              
//------------------------------------------------------------------------------
// CP0CN Enums (Charge Pump Configuration @ 0xA4)
//------------------------------------------------------------------------------
#define CP0CN_CP_STARTUP_DONE__BMASK   0x01 ///< Startup Status                  
#define CP0CN_CP_STARTUP_DONE__SHIFT   0x00 ///< Startup Status                  
#define CP0CN_CP_STARTUP_DONE__ONGOING 0x00 ///< Startup in progress.            
#define CP0CN_CP_STARTUP_DONE__DONE    0x01 ///< Startup done.                   
                                                                                 
#define CP0CN_CP_CLKINV__BMASK         0x04 ///< Invert Clock                    
#define CP0CN_CP_CLKINV__SHIFT         0x02 ///< Invert Clock                    
#define CP0CN_CP_CLKINV__NORMAL        0x00 ///< Normal clock signal.            
#define CP0CN_CP_CLKINV__INVERTED      0x04 ///< Inverted clock signal.          
                                                                                 
#define CP0CN_EN_CPLDO__BMASK          0x40 ///< Enable Charge Pump LDO          
#define CP0CN_EN_CPLDO__SHIFT          0x06 ///< Enable Charge Pump LDO          
#define CP0CN_EN_CPLDO__DISABLED       0x00 ///<                                 
#define CP0CN_EN_CPLDO__ENABLED        0x40 ///<                                 
                                                                                 
