mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define CMP1CN0_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CMP1CN0_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CMP1CN0_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                 ///< flag was last cleared.                            
#define CMP1CN0_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                        
#define CMP1CN0_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CMP1CN0_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CMP1CN0_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.                           
#define CMP1CN0_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.                           
                                                                                                        
#define CMP1CN0_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CMP1CN0_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CMP1CN0_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CMP1CN0_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                        
//------------------------------------------------------------------------------
// CMP1CN1 Enums (Comparator 1 Control 1 @ 0xAC)
//------------------------------------------------------------------------------
#define CMP1CN1_DACLVL__FMASK   0x0F ///< Internal Comparator DAC Reference Level           
#define CMP1CN1_DACLVL__SHIFT   0x00 ///< Internal Comparator DAC Reference Level           
                                                                                            
#define CMP1CN1_DACEN__BMASK    0x20 ///< DAC Enable                                        
#define CMP1CN1_DACEN__SHIFT    0x05 ///< DAC Enable                                        
#define CMP1CN1_DACEN__DISABLED 0x00 ///< DAC is disabled.                                  
#define CMP1CN1_DACEN__ENABLED  0x20 ///< DAC is enabled.                                   
                                                                                            
#define CMP1CN1_CPINH__BMASK    0x80 ///< Output Inhibit                                    
#define CMP1CN1_CPINH__SHIFT    0x07 ///< Output Inhibit                                    
#define CMP1CN1_CPINH__DISABLED 0x00 ///< The comparator output will always reflect the     
                                     ///< input conditions.                                 
#define CMP1CN1_CPINH__ENABLED  0x80 ///< The comparator output will hold state any time the
                                     ///< PCA CEX2 channel is low.                          
                                                                                            
//------------------------------------------------------------------------------
// CMP1MD Enums (Comparator 1 Mode @ 0xAB)
//------------------------------------------------------------------------------
#define CMP1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CMP1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CMP1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption).                               
#define CMP1MD_CPMD__MODE1              0x01 ///< Mode 1.                                     
#define CMP1MD_CPMD__MODE2              0x02 ///< Mode 2.                                     
#define CMP1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption).                               
                                                                                              
#define CMP1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CMP1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CMP1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CMP1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CMP1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CMP1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CMP1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CMP1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
#define CMP1MD_CPINV__BMASK             0x40 ///< Output Inversion                            
#define CMP1MD_CPINV__SHIFT             0x06 ///< Output Inversion                            
#define CMP1MD_CPINV__NORMAL            0x00 ///< Output is not inverted.                     
#define CMP1MD_CPINV__INVERT            0x40 ///< Output is inverted.                         
                                                                                              
#define CMP1MD_CPLOUT__BMASK            0x80 ///< Comparator Latched Output Flag              
#define CMP1MD_CPLOUT__SHIFT            0x07 ///< Comparator Latched Output Flag              
#define CMP1MD_CPLOUT__LOW              0x00 ///< Comparator output was logic low at last PCA 
                                             ///< overflow.                                   
#define CMP1MD_CPLOUT__HIGH             0x80 ///< Comparator output was logic high at last PCA
                                             ///< overflow.                                   
                                                                                              
//------------------------------------------------------------------------------
// CMP1MX Enums (Comparator 1 Multiplexer Selection @ 0xAA)
//------------------------------------------------------------------------------
#define CMP1MX_CMXP__FMASK   0x0F ///< Comparator Positive Input MUX Selection
#define CMP1MX_CMXP__SHIFT   0x00 ///< Comparator Positive Input MUX Selection
#define CMP1MX_CMXP__CMP1P0  0x00 ///< External pin CMP1P.0.                  
#define CMP1MX_CMXP__CMP1P1  0x01 ///< External pin CMP1P.1.                  
#define CMP1MX_CMXP__CMP1P2  0x02 ///< External pin CMP1P.2.                  
#define CMP1MX_CMXP__CMP1P3  0x03 ///< External pin CMP1P.3.                  
#define CMP1MX_CMXP__CMP1P4  0x04 ///< External pin CMP1P.4.                  
#define CMP1MX_CMXP__CMP1P5  0x05 ///< External pin CMP1P.5.                  
#define CMP1MX_CMXP__CMP1P6  0x06 ///< External pin CMP1P.6.                  
#define CMP1MX_CMXP__CMP1P7  0x07 ///< External pin CMP1P.7.                  
#define CMP1MX_CMXP__CMP1P8  0x08 ///< External pin CMP1P.8.                  
#define CMP1MX_CMXP__CMP1P9  0x09 ///< External pin CMP1P.9.                  
#define CMP1MX_CMXP__CMP1P10 0x0A ///< External pin CMP1P.10.                 
#define CMP1MX_CMXP__CMP1P11 0x0B ///< External pin CMP1P.11.                 
#define CMP1MX_CMXP__CMP1P12 0x0C ///< External pin CMP1P.12.                 
#define CMP1MX_CMXP__CMP1P13 0x0D ///< External pin CMP1P.13.                 
#define CMP1MX_CMXP__CMP1P14 0x0E ///< External pin CMP1P.14.                 
#define CMP1MX_CMXP__CMP1P15 0x0F ///< External pin CMP1P.15.                 
                                                                              
#define CMP1MX_CMXN__FMASK   0xF0 ///< Comparator Negative Input MUX Selection
#define CMP1MX_CMXN__SHIFT   0x04 ///< Comparator Negative Input MUX Selection
#define CMP1MX_CMXN__CMP1N0  0x00 ///< External pin CMP1N.0.                  
#define CMP1MX_CMXN__CMP1N1  0x10 ///< External pin CMP1N.1.                  
#define CMP1MX_CMXN__CMP1N2  0x20 ///< External pin CMP1N.2.                  
#define CMP1MX_CMXN__CMP1N3  0x30 ///< External pin CMP1N.3.                  
#define CMP1MX_CMXN__CMP1N4  0x40 ///< External pin CMP1N.4.                  
#define CMP1MX_CMXN__CMP1N5  0x50 ///< External pin CMP1N.5.                  
#define CMP1MX_CMXN__CMP1N6  0x60 ///< External pin CMP1N.6.                  
#define CMP1MX_CMXN__CMP1N7  0x70 ///< External pin CMP1N.7.                  
#define CMP1MX_CMXN__CMP1N8  0x80 ///< External pin CMP1N.8.                  
#define CMP1MX_CMXN__CMP1N9  0x90 ///< External pin CMP1N.9.                  
#define CMP1MX_CMXN__CMP1N10 0xA0 ///< External pin CMP1N.10.                 
#define CMP1MX_CMXN__CMP1N11 0xB0 ///< External pin CMP1N.11.                 
#define CMP1MX_CMXN__CMP1N12 0xC0 ///< External pin CMP1N.12.                 
#define CMP1MX_CMXN__CMP1N13 0xD0 ///< External pin CMP1N.13.                 
#define CMP1MX_CMXN__CMP1N14 0xE0 ///< External pin CMP1N.14.                 
#define CMP1MX_CMXN__CMP1N15 0xF0 ///< External pin CMP1N.15.                 
                                                                              
//------------------------------------------------------------------------------
// CRC0CN0 Enums (CRC0 Control 0 @ 0xCE)
//------------------------------------------------------------------------------
#define CRC0CN0_CRCPNT__BMASK        0x01 ///< CRC Result Pointer                               
#define CRC0CN0_CRCPNT__SHIFT        0x00 ///< CRC Result Pointer                               
#define CRC0CN0_CRCPNT__ACCESS_LOWER 0x00 ///< CRC0DAT accesses bits 7-0 of the 16-bit CRC      
                                          ///< result.                                          
#define CRC0CN0_CRCPNT__ACCESS_UPPER 0x01 ///< CRC0DAT accesses bits 15-8 of the 16-bit CRC     
                                          ///< result.                                          
                                                                                                
#define CRC0CN0_CRCVAL__BMASK        0x04 ///< CRC Initialization Value                         
#define CRC0CN0_CRCVAL__SHIFT        0x02 ///< CRC Initialization Value                         
#define CRC0CN0_CRCVAL__SET_ZEROES   0x00 ///< CRC result is set to 0x0000 on write of 1 to     
                                          ///< CRCINIT.                                         
#define CRC0CN0_CRCVAL__SET_ONES     0x04 ///< CRC result is set to 0xFFFF on write of 1 to     
                                          ///< CRCINIT.                                         
                                                                                                
#define CRC0CN0_CRCINIT__BMASK       0x08 ///< CRC Initialization Enable                        
#define CRC0CN0_CRCINIT__SHIFT       0x03 ///< CRC Initialization Enable                        
#define CRC0CN0_CRCINIT__DO_NOT_INIT 0x00 ///< Do not initialize the CRC result.                
#define CRC0CN0_CRCINIT__INIT        0x08 ///< Initialize the CRC result to ones or zeroes vased
                                          ///< on the value of CRCVAL.                          
                                                                                                
//------------------------------------------------------------------------------
// CRC0CN1 Enums (CRC0 Control 1 @ 0x86)
//------------------------------------------------------------------------------
#define CRC0CN1_CRCDN__BMASK     0x40 ///< Automatic CRC Calculation Complete        
#define CRC0CN1_CRCDN__SHIFT     0x06 ///< Automatic CRC Calculation Complete        
#define CRC0CN1_CRCDN__NOT_SET   0x00 ///< A CRC calculation is in progress.         
#define CRC0CN1_CRCDN__SET       0x40 ///< A CRC calculation is not in progress.     
                                                                                     
#define CRC0CN1_AUTOEN__BMASK    0x80 ///< Automatic CRC Calculation Enable          
#define CRC0CN1_AUTOEN__SHIFT    0x07 ///< Automatic CRC Calculation Enable          
#define CRC0CN1_AUTOEN__DISABLED 0x00 ///< Disable automatic CRC operations on flash.
#define CRC0CN1_AUTOEN__ENABLED  0x80 ///< Enable automatic CRC operations on flash. 
                                                                                     
//------------------------------------------------------------------------------
// CRC0CNT Enums (CRC0 Automatic Flash Sector Count @ 0xD3)
//------------------------------------------------------------------------------
#define CRC0CNT_CRCCNT__FMASK 0xFF ///< Automatic CRC Calculation Block Count
#define CRC0CNT_CRCCNT__SHIFT 0x00 ///< Automatic CRC Calculation Block Count
                                                                             
//------------------------------------------------------------------------------
// CRC0DAT Enums (CRC0 Data Output @ 0xCB)
//------------------------------------------------------------------------------
#define CRC0DAT_CRC0DAT__FMASK 0xFF ///< CRC Data Output
#define CRC0DAT_CRC0DAT__SHIFT 0x00 ///< CRC Data Output
                                                        
//------------------------------------------------------------------------------
// CRC0FLIP Enums (CRC0 Bit Flip @ 0xCF)
//------------------------------------------------------------------------------
#define CRC0FLIP_CRC0FLIP__FMASK 0xFF ///< CRC0 Bit Flip
#define CRC0FLIP_CRC0FLIP__SHIFT 0x00 ///< CRC0 Bit Flip
                                                        
//------------------------------------------------------------------------------
// CRC0IN Enums (CRC0 Data Input @ 0xCA)
//------------------------------------------------------------------------------
#define CRC0IN_CRC0IN__FMASK 0xFF ///< CRC Data Input
#define CRC0IN_CRC0IN__SHIFT 0x00 ///< CRC Data Input
                                                     
//------------------------------------------------------------------------------
// CRC0ST Enums (CRC0 Automatic Flash Sector Start @ 0xD2)
//------------------------------------------------------------------------------
#define CRC0ST_CRCST__FMASK 0xFF ///< Automatic CRC Calculation Starting Block
#define CRC0ST_CRCST__SHIFT 0x00 ///< Automatic CRC Calculation Starting Block
                                                                              
//------------------------------------------------------------------------------
// DAC0ALT Enums (Alternate Mode Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define DAC0ALT_DAC0ALT__FMASK 0xFF ///< Alternate Mode Low Byte
#define DAC0ALT_DAC0ALT__SHIFT 0x00 ///< Alternate Mode Low Byte
                                                                
//------------------------------------------------------------------------------
// DAC0CF0 Enums (DAC0 Configuration 0 @ 0x91)
//------------------------------------------------------------------------------
#define DAC0CF0_UPDATE__FMASK       0x0F ///< DAC0 Update Trigger Source                        
#define DAC0CF0_UPDATE__SHIFT       0x00 ///< DAC0 Update Trigger Source                        
#define DAC0CF0_UPDATE__SYSCLK      0x00 ///< DAC0 output updates occur on every clock cycle.   
#define DAC0CF0_UPDATE__TIMER3      0x01 ///< DAC0 output updates occur on Timer 3 high byte    
                                         ///< overflow.                                         
#define DAC0CF0_UPDATE__TIMER4      0x02 ///< DAC0 output updates occur on Timer 4 high byte    
                                         ///< overflow.                                         
#define DAC0CF0_UPDATE__TIMER5      0x03 ///< DAC0 output updates occur on Timer 5 high byte    
                                         ///< overflow.                                         
#define DAC0CF0_UPDATE__CLU0        0x04 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 0 rising edge.                             
#define DAC0CF0_UPDATE__CLU1        0x05 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 1 rising edge.                             
#define DAC0CF0_UPDATE__CLU2        0x06 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 2 rising edge.                             
#define DAC0CF0_UPDATE__CLU3        0x07 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 3 rising edge.                             
#define DAC0CF0_UPDATE__PWM0X       0x08 ///< DAC0 output updates occur on PWM Ch0 Phase X      
                                         ///< rising edge.                                      
#define DAC0CF0_UPDATE__PWM0Y       0x09 ///< DAC0 output updates occur on PWM Ch0 Phase Y      
                                         ///< rising edge.                                      
                                                                                                
#define DAC0CF0_LJST__BMASK         0x20 ///< DAC0 Left Justify Enable                          
#define DAC0CF0_LJST__SHIFT         0x05 ///< DAC0 Left Justify Enable                          
#define DAC0CF0_LJST__RIGHT_JUSTIFY 0x00 ///< DAC0 input is treated as right-justified.         
#define DAC0CF0_LJST__LEFT_JUSTIFY  0x20 ///< DAC0 input is treated as left-justified.          
                                                                                                
#define DAC0CF0_RSTMD__BMASK        0x40 ///< DAC0 Reset Mode                                   
#define DAC0CF0_RSTMD__SHIFT        0x06 ///< DAC0 Reset Mode                                   
#define DAC0CF0_RSTMD__NORMAL       0x00 ///< All resets will reset DAC0 and its associated     
                                         ///< registers.                                        
#define DAC0CF0_RSTMD__PERSIST      0x40 ///< DAC0 output will persist through all resets except
                                         ///< for power-on-resets.                              
                                                                                                
