mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define DAC0CF0_EN__BMASK           0x80 ///< DAC0 Enable                                       
#define DAC0CF0_EN__SHIFT           0x07 ///< DAC0 Enable                                       
#define DAC0CF0_EN__DISABLE         0x00 ///< DAC0 is disabled and not driven at the output pin.
#define DAC0CF0_EN__ENABLE          0x80 ///< DAC0 is enabled and will drive the output pin.    
                                                                                                
//------------------------------------------------------------------------------
// DAC0CF1 Enums (DAC0 Configuration 1 @ 0x92)
//------------------------------------------------------------------------------
#define DAC0CF1_GAINADJ__BMASK    0x01 ///< DAC0 Output Gain Adjust                           
#define DAC0CF1_GAINADJ__SHIFT    0x00 ///< DAC0 Output Gain Adjust                           
#define DAC0CF1_GAINADJ__FALSE    0x00 ///< DAC output gain is 1.                             
#define DAC0CF1_GAINADJ__TRUE     0x01 ///< DAC output gain is 2.                             
                                                                                              
#define DAC0CF1_VREFSEL__BMASK    0x02 ///< DAC0 voltage Reference                            
#define DAC0CF1_VREFSEL__SHIFT    0x01 ///< DAC0 voltage Reference                            
#define DAC0CF1_VREFSEL__VDD      0x00 ///< Select the VDD supply.                            
#define DAC0CF1_VREFSEL__VREF     0x02 ///< Select the VREF pin.                              
                                                                                              
#define DAC0CF1_AMEN__BMASK       0x04 ///< DAC0 Alternating Mode                             
#define DAC0CF1_AMEN__SHIFT       0x02 ///< DAC0 Alternating Mode                             
#define DAC0CF1_AMEN__FALSE       0x00 ///< DAC always updates from DAC0H:DAC0L.              
#define DAC0CF1_AMEN__TRUE        0x04 ///< DAC updates occur on the rising or falling edge of
                                       ///< the trigger signal. On a rising edge, the DAC     
                                       ///< receives the DAC0H/L registers. On a falling edge,
                                       ///< the DAC receives the data source selected in SRC. 
                                       ///< *This mode may only be used with Configurable     
                                       ///< Logic trigger sources.*                           
                                                                                              
#define DAC0CF1_SRC__BMASK        0x08 ///< DAC0 Data Source                                  
#define DAC0CF1_SRC__SHIFT        0x03 ///< DAC0 Data Source                                  
#define DAC0CF1_SRC__DACALT       0x00 ///< DAC data is from DAC0H[7:6]:DAC0ALT if LJST is 0. 
                                       ///< DAC data is from DAC0L[1:0]:DAC0ALT if LJST is 1. 
#define DAC0CF1_SRC__DACXORDACALT 0x08 ///< DAC data is XOR of DAC0H[1:0]:DAC0L and           
                                       ///< DAC0H[7:6]:DAC0ALT if LJST is 0. DAC data is XOR  
                                       ///< of DAC0H:DAC0L[7:6] and DAC0L[1:0]:DAC0ALT if LJST
                                       ///< is 1.                                             
                                                                                              
//------------------------------------------------------------------------------
// DAC0H Enums (DAC0 Data Word High Byte @ 0x85)
//------------------------------------------------------------------------------
#define DAC0H_DAC0H__FMASK 0xFF ///< Data Word High Byte
#define DAC0H_DAC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// DAC0L Enums (DAC0 Data Word Low Byte @ 0x84)
//------------------------------------------------------------------------------
#define DAC0L_DAC0L__FMASK 0xFF ///< Data Word Low Byte
#define DAC0L_DAC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// DERIVID Enums (Derivative Identification @ 0xAD)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK                0xFF ///< Derivative ID           
#define DERIVID_DERIVID__SHIFT                0x00 ///< Derivative ID           
#define DERIVID_DERIVID__EFM8BB52F32G_QFN32   0x01 ///< EFM8BB52F32G-{R}-QFN32  
#define DERIVID_DERIVID__EFM8BB52F16G_QFN20   0x02 ///< EFM8BB52F16G-{R}-QFN20  
#define DERIVID_DERIVID__EFM8BB52F16G_TSSOP28 0x03 ///< EFM8BB52F16G-{R}-TSSOP28
#define DERIVID_DERIVID__EFM8BB52F16G_QFN32   0x04 ///< EFM8BB52F16G-{R}-QFN32  
#define DERIVID_DERIVID__EFM8BB52F32G_TSSOP20 0x05 ///< EFM8BB52F32G-{R}-TSSOP20
#define DERIVID_DERIVID__EFM8BB52F32G_QFN20   0x06 ///< EFM8BB52F32G-{R}-QFN20  
#define DERIVID_DERIVID__EFM8BB52F32G_TSSOP28 0x07 ///< EFM8BB52F32G-{R}-TSSOP28
#define DERIVID_DERIVID__EFM8BB52F16G_TSSOP20 0x08 ///< EFM8BB52F16G-{R}-TSSOP20
#define DERIVID_DERIVID__EFM8BB52F16I_TSSOP20 0x09 ///< EFM8BB52F16I-{R}-TSSOP20
#define DERIVID_DERIVID__EFM8BB52F16I_QFN20   0x0A ///< EFM8BB52F16I-{R}-QFN20  
#define DERIVID_DERIVID__EFM8BB52F16I_TSSOP28 0x0B ///< EFM8BB52F16I-{R}-TSSOP28
#define DERIVID_DERIVID__EFM8BB52F16I_QFN32   0x0C ///< EFM8BB52F16I-{R}-QFN32  
#define DERIVID_DERIVID__EFM8BB52F32I_TSSOP20 0x0D ///< EFM8BB52F32I-{R}-TSSOP20
#define DERIVID_DERIVID__EFM8BB52F32I_QFN20   0x0E ///< EFM8BB52F32I-{R}-QFN20  
#define DERIVID_DERIVID__EFM8BB52F32I_TSSOP28 0x0F ///< EFM8BB52F32I-{R}-TSSOP28
#define DERIVID_DERIVID__EFM8BB52F32I_QFN32   0x10 ///< EFM8BB52F32I-{R}-QFN32  
                                                                                
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xB5)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xB6)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A.
                                                
//------------------------------------------------------------------------------
// PCON0 Enums (Power Control 0 @ 0x87)
//------------------------------------------------------------------------------
#define PCON0_CPUIDLE__BMASK 0x01 ///< Idle Mode
#define PCON0_CPUIDLE__SHIFT 0x00 ///< Idle Mode
                                                
#define PCON0_CPUSTOP__BMASK 0x02 ///< Stop Mode
#define PCON0_CPUSTOP__SHIFT 0x01 ///< Stop Mode
                                                
#define PCON0_CPUGP__FMASK   0xFC ///< CPU Flags
#define PCON0_CPUGP__SHIFT   0x02 ///< CPU Flags
                                                
//------------------------------------------------------------------------------
// PCON1 Enums (Power Control 1 @ 0xCD)
//------------------------------------------------------------------------------
#define PCON1_PINRETAIN__BMASK  0x01 ///< Pin Retain                                        
#define PCON1_PINRETAIN__SHIFT  0x00 ///< Pin Retain                                        
#define PCON1_PINRETAIN__RESET  0x00 ///< GPIO logic is reset when any reset event is       
                                     ///< asserted.                                         
#define PCON1_PINRETAIN__RETAIN 0x01 ///< Pins will retain state across any reset except for
                                     ///< power-on-reset events. Note that although pin     
                                     ///< configurations are maintained, the values of the  
                                     ///< pin control registers are reset. Registers PnMDIN,
                                     ///< PnMDOUT, Pn, and the XBARE bit may not reflect the
                                     ///< actual pin configuration at this time. New values 
                                     ///< written to these registers will take effect upon  
                                     ///< the write event.                                  
                                                                                            
#define PCON1_SNOOZE__BMASK     0x80 ///< Snooze                                            
#define PCON1_SNOOZE__SHIFT     0x07 ///< Snooze                                            
#define PCON1_SNOOZE__ACTIVE    0x00 ///< Device is still active in snooze mode.            
#define PCON1_SNOOZE__SNOOZE    0x80 ///< Device is in snooze mode. High speed oscillators  
                                     ///< will be halted the SYSCLK signal will be gated    
                                     ///< off, and the internal regulator will be placed in 
                                     ///< a low power state.                                
                                                                                            
//------------------------------------------------------------------------------
// PSTAT0 Enums (PMU Status 0 @ 0xAA)
//------------------------------------------------------------------------------
#define PSTAT0_CPT0WK__BMASK    0x01 ///< Comparator 0 Wake Flag                   
#define PSTAT0_CPT0WK__SHIFT    0x00 ///< Comparator 0 Wake Flag                   
#define PSTAT0_CPT0WK__NOWAKE   0x00 ///< No wake event occurred.                  
#define PSTAT0_CPT0WK__WAKEFLAG 0x01 ///< A wake event occurred during snooze mode.
                                                                                   
#define PSTAT0_PMATWK__BMASK    0x02 ///< Port Match Wake Flag                     
#define PSTAT0_PMATWK__SHIFT    0x01 ///< Port Match Wake Flag                     
#define PSTAT0_PMATWK__NOWAKE   0x00 ///< No wake event occurred.                  
#define PSTAT0_PMATWK__WAKEFLAG 0x02 ///< A wake event occurred during snooze mode.
                                                                                   
#define PSTAT0_TMR4WK__BMASK    0x04 ///< Timer 4 Wake Flag                        
#define PSTAT0_TMR4WK__SHIFT    0x02 ///< Timer 4 Wake Flag                        
#define PSTAT0_TMR4WK__NOWAKE   0x00 ///< No wake event occurred.                  
#define PSTAT0_TMR4WK__WAKEFLAG 0x04 ///< A wake event occurred during snooze mode.
                                                                                   
#define PSTAT0_CL0WK__BMASK     0x20 ///< Configurable Logic Wake Flag             
#define PSTAT0_CL0WK__SHIFT     0x05 ///< Configurable Logic Wake Flag             
#define PSTAT0_CL0WK__NOWAKE    0x00 ///< No wake event occurred.                  
#define PSTAT0_CL0WK__WAKEFLAG  0x20 ///< A wake event occurred during snooze mode.
                                                                                   
//------------------------------------------------------------------------------
// REG0CN Enums (Regulator 0 Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_STOPCF__BMASK    0x08 ///< Stop and Shutdown Mode Configuration              
#define REG0CN_STOPCF__SHIFT    0x03 ///< Stop and Shutdown Mode Configuration              
#define REG0CN_STOPCF__ACTIVE   0x00 ///< Regulator is still active in stop mode. Any       
                                     ///< enabled reset source will reset the device.       
#define REG0CN_STOPCF__SHUTDOWN 0x08 ///< Regulator is shut down in stop mode (device enters
                                     ///< Shutdown mode). Only the RSTb pin or power cycle  
                                     ///< can reset the device.                             
                                                                                            
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
