mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define XBR0_SYSCKE__BMASK    0x80 ///< SYSCLK Output Enable                             
#define XBR0_SYSCKE__SHIFT    0x07 ///< SYSCLK Output Enable                             
#define XBR0_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.                  
#define XBR0_SYSCKE__ENABLED  0x80 ///< SYSCLK output routed to Port pin.                
                                                                                         
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_PCA0ME__FMASK        0x03 ///< PCA Module I/O Enable                
#define XBR1_PCA0ME__SHIFT        0x00 ///< PCA Module I/O Enable                
#define XBR1_PCA0ME__DISABLED     0x00 ///< All PCA I/O unavailable at Port pins.
#define XBR1_PCA0ME__CEX0         0x01 ///< CEX0 routed to Port pin.             
#define XBR1_PCA0ME__CEX0_TO_CEX1 0x02 ///< CEX0, CEX1 routed to Port pins.      
#define XBR1_PCA0ME__CEX0_TO_CEX2 0x03 ///< CEX0, CEX1, CEX2 routed to Port pins.
                                                                                 
#define XBR1_ECIE__BMASK          0x08 ///< PCA0 External Counter Input Enable   
#define XBR1_ECIE__SHIFT          0x03 ///< PCA0 External Counter Input Enable   
#define XBR1_ECIE__DISABLED       0x00 ///< ECI unavailable at Port pin.         
#define XBR1_ECIE__ENABLED        0x08 ///< ECI routed to Port pin.              
                                                                                 
#define XBR1_T0E__BMASK           0x10 ///< T0 Enable                            
#define XBR1_T0E__SHIFT           0x04 ///< T0 Enable                            
#define XBR1_T0E__DISABLED        0x00 ///< T0 unavailable at Port pin.          
#define XBR1_T0E__ENABLED         0x10 ///< T0 routed to Port pin.               
                                                                                 
#define XBR1_T1E__BMASK           0x20 ///< T1 Enable                            
#define XBR1_T1E__SHIFT           0x05 ///< T1 Enable                            
#define XBR1_T1E__DISABLED        0x00 ///< T1 unavailable at Port pin.          
#define XBR1_T1E__ENABLED         0x20 ///< T1 routed to Port pin.               
                                                                                 
#define XBR1_T2E__BMASK           0x40 ///< T2 Enable                            
#define XBR1_T2E__SHIFT           0x06 ///< T2 Enable                            
#define XBR1_T2E__DISABLED        0x00 ///< T2 unavailable at Port pin.          
#define XBR1_T2E__ENABLED         0x40 ///< T2 routed to Port pin.               
                                                                                 
#define XBR1_SMB1E__BMASK         0x80 ///< SMB1 I/O Enable                      
#define XBR1_SMB1E__SHIFT         0x07 ///< SMB1 I/O Enable                      
#define XBR1_SMB1E__DISABLED      0x00 ///< SMBus 1 I/O unavailable at Port pins.
#define XBR1_SMB1E__ENABLED       0x80 ///< SMBus 1 I/O routed to Port pins.     
                                                                                 
//------------------------------------------------------------------------------
// XBR2 Enums (Port I/O Crossbar 2 @ 0xE3)
//------------------------------------------------------------------------------
#define XBR2_URT1E__BMASK               0x01 ///< UART1 I/O Enable                                  
#define XBR2_URT1E__SHIFT               0x00 ///< UART1 I/O Enable                                  
#define XBR2_URT1E__DISABLED            0x00 ///< UART1 I/O unavailable at Port pin.                
#define XBR2_URT1E__ENABLED             0x01 ///< UART1 TX1 RX1 routed to Port pins.                
                                                                                                    
#define XBR2_URT1RTSE__BMASK            0x02 ///< UART1 RTS Output Enable                           
#define XBR2_URT1RTSE__SHIFT            0x01 ///< UART1 RTS Output Enable                           
#define XBR2_URT1RTSE__DISABLED         0x00 ///< UART1 RTS1 unavailable at Port pin.               
#define XBR2_URT1RTSE__ENABLED          0x02 ///< UART1 RTS1 routed to Port pin.                    
                                                                                                    
#define XBR2_URT1CTSE__BMASK            0x04 ///< UART1 CTS Input Enable                            
#define XBR2_URT1CTSE__SHIFT            0x02 ///< UART1 CTS Input Enable                            
#define XBR2_URT1CTSE__DISABLED         0x00 ///< UART1 CTS1 unavailable at Port pin.               
#define XBR2_URT1CTSE__ENABLED          0x04 ///< UART1 CTS1 routed to Port pin.                    
                                                                                                    
#define XBR2_PWME__FMASK                0x18 ///< PWM I/O Enable                                    
#define XBR2_PWME__SHIFT                0x03 ///< PWM I/O Enable                                    
#define XBR2_PWME__DISABLED             0x00 ///< PWM I/O unavailable at Port pin.                  
#define XBR2_PWME__PWM0CH0              0x08 ///< PWM0 Ch0 routed to Port pin.                      
#define XBR2_PWME__PWM0CH01             0x10 ///< PWM0 Ch0 and Ch1 routed to Port pin.              
#define XBR2_PWME__PWM0CH012            0x18 ///< PWM0 Ch0, Ch1, and Ch2 routed to Port pin.        
                                                                                                    
#define XBR2_PWMDE__BMASK               0x20 ///< PWM Differential Mode Enable                      
#define XBR2_PWMDE__SHIFT               0x05 ///< PWM Differential Mode Enable                      
#define XBR2_PWMDE__SINGLE              0x00 ///< PWM single ended output for all enabled channels. 
#define XBR2_PWMDE__DIFF                0x20 ///< PWM complementary output for all enabled channels.
                                                                                                    
#define XBR2_XBARE__BMASK               0x40 ///< Crossbar Enable                                   
#define XBR2_XBARE__SHIFT               0x06 ///< Crossbar Enable                                   
#define XBR2_XBARE__DISABLED            0x00 ///< Crossbar disabled.                                
#define XBR2_XBARE__ENABLED             0x40 ///< Crossbar enabled.                                 
                                                                                                    
