mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define P3MDIN_B4__BMASK   0x10 ///< Port 3 Bit 4 Input Mode                 
#define P3MDIN_B4__SHIFT   0x04 ///< Port 3 Bit 4 Input Mode                 
#define P3MDIN_B4__ANALOG  0x00 ///< P3.4 pin is configured for analog mode. 
#define P3MDIN_B4__DIGITAL 0x10 ///< P3.4 pin is configured for digital mode.
                                                                             
#define P3MDIN_B5__BMASK   0x20 ///< Port 3 Bit 5 Input Mode                 
#define P3MDIN_B5__SHIFT   0x05 ///< Port 3 Bit 5 Input Mode                 
#define P3MDIN_B5__ANALOG  0x00 ///< P3.5 pin is configured for analog mode. 
#define P3MDIN_B5__DIGITAL 0x20 ///< P3.5 pin is configured for digital mode.
                                                                             
#define P3MDIN_B6__BMASK   0x40 ///< Port 3 Bit 6 Input Mode                 
#define P3MDIN_B6__SHIFT   0x06 ///< Port 3 Bit 6 Input Mode                 
#define P3MDIN_B6__ANALOG  0x00 ///< P3.6 pin is configured for analog mode. 
#define P3MDIN_B6__DIGITAL 0x40 ///< P3.6 pin is configured for digital mode.
                                                                             
#define P3MDIN_B7__BMASK   0x80 ///< Port 3 Bit 7 Input Mode                 
#define P3MDIN_B7__SHIFT   0x07 ///< Port 3 Bit 7 Input Mode                 
#define P3MDIN_B7__ANALOG  0x00 ///< P3.7 pin is configured for analog mode. 
#define P3MDIN_B7__DIGITAL 0x80 ///< P3.7 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// P3MDOUT Enums (Port 3 Output Mode @ 0x9C)
//------------------------------------------------------------------------------
#define P3MDOUT_B0__BMASK      0x01 ///< Port 3 Bit 0 Output Mode  
#define P3MDOUT_B0__SHIFT      0x00 ///< Port 3 Bit 0 Output Mode  
#define P3MDOUT_B0__OPEN_DRAIN 0x00 ///< P3.0 output is open-drain.
#define P3MDOUT_B0__PUSH_PULL  0x01 ///< P3.0 output is push-pull. 
                                                                   
#define P3MDOUT_B1__BMASK      0x02 ///< Port 3 Bit 1 Output Mode  
#define P3MDOUT_B1__SHIFT      0x01 ///< Port 3 Bit 1 Output Mode  
#define P3MDOUT_B1__OPEN_DRAIN 0x00 ///< P3.1 output is open-drain.
#define P3MDOUT_B1__PUSH_PULL  0x02 ///< P3.1 output is push-pull. 
                                                                   
#define P3MDOUT_B2__BMASK      0x04 ///< Port 3 Bit 2 Output Mode  
#define P3MDOUT_B2__SHIFT      0x02 ///< Port 3 Bit 2 Output Mode  
#define P3MDOUT_B2__OPEN_DRAIN 0x00 ///< P3.2 output is open-drain.
#define P3MDOUT_B2__PUSH_PULL  0x04 ///< P3.2 output is push-pull. 
                                                                   
#define P3MDOUT_B3__BMASK      0x08 ///< Port 3 Bit 3 Output Mode  
#define P3MDOUT_B3__SHIFT      0x03 ///< Port 3 Bit 3 Output Mode  
#define P3MDOUT_B3__OPEN_DRAIN 0x00 ///< P3.3 output is open-drain.
#define P3MDOUT_B3__PUSH_PULL  0x08 ///< P3.3 output is push-pull. 
                                                                   
#define P3MDOUT_B4__BMASK      0x10 ///< Port 3 Bit 4 Output Mode  
#define P3MDOUT_B4__SHIFT      0x04 ///< Port 3 Bit 4 Output Mode  
#define P3MDOUT_B4__OPEN_DRAIN 0x00 ///< P3.4 output is open-drain.
#define P3MDOUT_B4__PUSH_PULL  0x10 ///< P3.4 output is push-pull. 
                                                                   
#define P3MDOUT_B5__BMASK      0x20 ///< Port 3 Bit 5 Output Mode  
#define P3MDOUT_B5__SHIFT      0x05 ///< Port 3 Bit 5 Output Mode  
#define P3MDOUT_B5__OPEN_DRAIN 0x00 ///< P3.5 output is open-drain.
#define P3MDOUT_B5__PUSH_PULL  0x20 ///< P3.5 output is push-pull. 
                                                                   
#define P3MDOUT_B6__BMASK      0x40 ///< Port 3 Bit 6 Output Mode  
#define P3MDOUT_B6__SHIFT      0x06 ///< Port 3 Bit 6 Output Mode  
#define P3MDOUT_B6__OPEN_DRAIN 0x00 ///< P3.6 output is open-drain.
#define P3MDOUT_B6__PUSH_PULL  0x40 ///< P3.6 output is push-pull. 
                                                                   
#define P3MDOUT_B7__BMASK      0x80 ///< Port 3 Bit 7 Output Mode  
#define P3MDOUT_B7__SHIFT      0x07 ///< Port 3 Bit 7 Output Mode  
#define P3MDOUT_B7__OPEN_DRAIN 0x00 ///< P3.7 output is open-drain.
#define P3MDOUT_B7__PUSH_PULL  0x80 ///< P3.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// PWMCPH0 Enums (Ch0 Compare Value MSB @ 0x9A)
//------------------------------------------------------------------------------
#define PWMCPH0_PWMCPH0__FMASK 0xFF ///< Ch0 Compare Value MSB
#define PWMCPH0_PWMCPH0__SHIFT 0x00 ///< Ch0 Compare Value MSB
                                                              
//------------------------------------------------------------------------------
// PWMCPL0 Enums (Ch0 Compare Value LSB @ 0x99)
//------------------------------------------------------------------------------
#define PWMCPL0_PWMCPL0__FMASK 0xFF ///< Ch0 Compare Value LSB
#define PWMCPL0_PWMCPL0__SHIFT 0x00 ///< Ch0 Compare Value LSB
                                                              
//------------------------------------------------------------------------------
// PWMCPUDH0 Enums (Ch0 Compare Value Update MSB @ 0xAC)
//------------------------------------------------------------------------------
#define PWMCPUDH0_PWMCPUDH0__FMASK 0xFF ///< Ch0 Compare Value Update MSB
#define PWMCPUDH0_PWMCPUDH0__SHIFT 0x00 ///< Ch0 Compare Value Update MSB
                                                                         
//------------------------------------------------------------------------------
// PWMCPUDL0 Enums (Ch0 Compare Value Update LSB @ 0xAB)
//------------------------------------------------------------------------------
#define PWMCPUDL0_PWMCPUDL0__FMASK 0xFF ///< Ch0 Compare Value Update LSB
#define PWMCPUDL0_PWMCPUDL0__SHIFT 0x00 ///< Ch0 Compare Value Update LSB
                                                                         
//------------------------------------------------------------------------------
// PWMCPH1 Enums (Ch1 Compare Value MSB @ 0xB6)
//------------------------------------------------------------------------------
#define PWMCPH1_PWMCPH1__FMASK 0xFF ///< Ch1 Compare Value MSB
#define PWMCPH1_PWMCPH1__SHIFT 0x00 ///< Ch1 Compare Value MSB
                                                              
//------------------------------------------------------------------------------
// PWMCPL1 Enums (Ch1 Compare Value LSB @ 0xB5)
//------------------------------------------------------------------------------
#define PWMCPL1_PWMCPL1__FMASK 0xFF ///< Ch1 Compare Value LSB
#define PWMCPL1_PWMCPL1__SHIFT 0x00 ///< Ch1 Compare Value LSB
                                                              
//------------------------------------------------------------------------------
// PWMCPUDH1 Enums (Ch1 Compare Value Update MSB @ 0xB3)
//------------------------------------------------------------------------------
#define PWMCPUDH1_PWMCPUDH1__FMASK 0xFF ///< Ch1 Compare Value Update MSB
#define PWMCPUDH1_PWMCPUDH1__SHIFT 0x00 ///< Ch1 Compare Value Update MSB
                                                                         
//------------------------------------------------------------------------------
// PWMCPUDL1 Enums (Ch1 Compare Value Update LSB @ 0xB2)
//------------------------------------------------------------------------------
#define PWMCPUDL1_PWMCPUDL1__FMASK 0xFF ///< Ch1 Compare Value Update LSB
#define PWMCPUDL1_PWMCPUDL1__SHIFT 0x00 ///< Ch1 Compare Value Update LSB
                                                                         
//------------------------------------------------------------------------------
// PWMCPH2 Enums (Ch2 Compare Value MSB @ 0xBE)
//------------------------------------------------------------------------------
#define PWMCPH2_PWMCPH2__FMASK 0xFF ///< Ch2 Compare Value MSB
#define PWMCPH2_PWMCPH2__SHIFT 0x00 ///< Ch2 Compare Value MSB
                                                              
//------------------------------------------------------------------------------
// PWMCPL2 Enums (Ch2 Compare Value LSB @ 0xBD)
//------------------------------------------------------------------------------
#define PWMCPL2_PWMCPL2__FMASK 0xFF ///< Ch2 Compare Value LSB
#define PWMCPL2_PWMCPL2__SHIFT 0x00 ///< Ch2 Compare Value LSB
                                                              
//------------------------------------------------------------------------------
// PWMCPUDH2 Enums (Ch2 Compare Value Update MSB @ 0xBA)
//------------------------------------------------------------------------------
#define PWMCPUDH2_PWMCPUDH2__FMASK 0xFF ///< Ch2 Compare Value Update MSB
#define PWMCPUDH2_PWMCPUDH2__SHIFT 0x00 ///< Ch2 Compare Value Update MSB
                                                                         
//------------------------------------------------------------------------------
// PWMCPUDL2 Enums (Ch2 Compare Value Update LSB @ 0xB9)
//------------------------------------------------------------------------------
#define PWMCPUDL2_PWMCPUDL2__FMASK 0xFF ///< Ch2 Compare Value Update LSB
#define PWMCPUDL2_PWMCPUDL2__SHIFT 0x00 ///< Ch2 Compare Value Update LSB
                                                                         
//------------------------------------------------------------------------------
// PWMCFG0 Enums (PWM Configuration 0 @ 0xC2)
//------------------------------------------------------------------------------
#define PWMCFG0_PWMCLKEN__BMASK    0x01 ///< PWM Clock Enable                                 
#define PWMCFG0_PWMCLKEN__SHIFT    0x00 ///< PWM Clock Enable                                 
#define PWMCFG0_PWMCLKEN__DISABLE  0x00 ///< Disable clock to the PWM module.                 
#define PWMCFG0_PWMCLKEN__ENABLE   0x01 ///< Enable clock to the PWM module.                  
                                                                                              
#define PWMCFG0_TRGESEL__BMASK     0x02 ///< External Trigger Edge Select                     
#define PWMCFG0_TRGESEL__SHIFT     0x01 ///< External Trigger Edge Select                     
#define PWMCFG0_TRGESEL__REDGE     0x00 ///< Rising edge on the enabled external trigger will 
                                        ///< start PWM counter.                               
#define PWMCFG0_TRGESEL__FEDGE     0x02 ///< Falling edge on the enabled external trigger will
                                        ///< start PWM counter.                               
                                                                                              
#define PWMCFG0_KILL0EN__BMASK     0x04 ///< Kill 0 enable                                    
#define PWMCFG0_KILL0EN__SHIFT     0x02 ///< Kill 0 enable                                    
#define PWMCFG0_KILL0EN__DISABLE   0x00 ///< Disable Kill0 signal to halt the PWM.            
#define PWMCFG0_KILL0EN__ENABLE    0x04 ///< Enable Kill0 signal to halt the PWM.             
                                                                                              
#define PWMCFG0_KILL1EN__BMASK     0x08 ///< Kill 1 enable                                    
#define PWMCFG0_KILL1EN__SHIFT     0x03 ///< Kill 1 enable                                    
#define PWMCFG0_KILL1EN__DISABLE   0x00 ///< Disable Kill1 signal to halt the PWM.            
#define PWMCFG0_KILL1EN__ENABLE    0x08 ///< Enable Kill1 signal to halt the PWM.             
                                                                                              
#define PWMCFG0_DBGSTLEN__BMASK    0x10 ///< Debug Stall Enable                               
#define PWMCFG0_DBGSTLEN__SHIFT    0x04 ///< Debug Stall Enable                               
#define PWMCFG0_DBGSTLEN__DISABLE  0x00 ///< PWM will continue running on breakpoints in debug
                                        ///< mode.                                            
#define PWMCFG0_DBGSTLEN__ENABLE   0x10 ///< PWM will stall on breakpoints in debug mode.     
                                                                                              
#define PWMCFG0_SYNCUPD__FMASK     0x60 ///< Channel Update Sync Mode                         
#define PWMCFG0_SYNCUPD__SHIFT     0x05 ///< Channel Update Sync Mode                         
#define PWMCFG0_SYNCUPD__NOSYNCUPD 0x00 ///< No channels will be synchronously updated.       
#define PWMCFG0_SYNCUPD__CH0       0x20 ///< Channel 0 will be synchronously updated.         
#define PWMCFG0_SYNCUPD__CH0CH1    0x40 ///< Channel 0 and Channel 1 will be synchronously    
                                        ///< updated.                                         
#define PWMCFG0_SYNCUPD__CH0CH1CH2 0x60 ///< Channel 0, Channel 1, and Channel 2 will be      
                                        ///< synchronously updated.                           
                                                                                              
#define PWMCFG0_PWMMODE__BMASK     0x80 ///< PWM Center/Edge-alignment mode                   
#define PWMCFG0_PWMMODE__SHIFT     0x07 ///< PWM Center/Edge-alignment mode                   
#define PWMCFG0_PWMMODE__EDGE      0x00 ///< PWM will operate in Edge-aligned mode.           
#define PWMCFG0_PWMMODE__CENTER    0x80 ///< PWM will operate in Center-aligned mode.         
                                                                                              
//------------------------------------------------------------------------------
// PWMCFG1 Enums (PWM Configuration 1 @ 0xC9)
//------------------------------------------------------------------------------
#define PWMCFG1_PWMEN__BMASK       0x01 ///< PWM Enable                                        
#define PWMCFG1_PWMEN__SHIFT       0x00 ///< PWM Enable                                        
#define PWMCFG1_PWMEN__DISABLE     0x00 ///< Disable PWM and stop the counter.                 
#define PWMCFG1_PWMEN__ENABLE      0x01 ///< Enable PWM. If TRGSEL = 0, start the counter.     
                                        ///< Otherwise, wait for hardware trigger to start the 
                                        ///< counter.                                          
                                                                                               
#define PWMCFG1_PWMLTSYS__BMASK    0x02 ///< PWM Clock Setting                                 
#define PWMCFG1_PWMLTSYS__SHIFT    0x01 ///< PWM Clock Setting                                 
#define PWMCFG1_PWMLTSYS__GTSYSCK  0x00 ///< PWM clock frequency is greater than or equal to   
                                        ///< SYSCLK.                                           
#define PWMCFG1_PWMLTSYS__LTSYSCK  0x02 ///< PWM clock frequency is less than SYSCLK.          
                                                                                               
#define PWMCFG1_DTIMODE__BMASK     0x04 ///< DTI Mode                                          
#define PWMCFG1_DTIMODE__SHIFT     0x02 ///< DTI Mode                                          
#define PWMCFG1_DTIMODE__RISING    0x00 ///< In edge-aligned mode, offset the rising edge of   
                                        ///< the CHnX pins from the overflow edge and the CHnY 
                                        ///< pins from the match edge. In center aligned-mode, 
                                        ///< offset the rising edge of the CHnX pins from the  
                                        ///< up edge and the CHnY pin from the down edge.      
#define PWMCFG1_DTIMODE__FALLING   0x04 ///< In edge-aligned mode, offset the falling edge of  
                                        ///< the CHnX pins from the match edge and the CHnY pin
                                        ///< from the overflow edge. In center aligned-mode,   
                                        ///< offset the falling edge of the CHnX pin from the  
                                        ///< down edge and the CHnY pin from the up edge.      
                                                                                               
#define PWMCFG1_DIFFMODE0__BMASK   0x08 ///< Channel 0 Differential Mode                       
#define PWMCFG1_DIFFMODE0__SHIFT   0x03 ///< Channel 0 Differential Mode                       
#define PWMCFG1_DIFFMODE0__DISABLE 0x00 ///< Differential mode is disabled on Channel 0.       
#define PWMCFG1_DIFFMODE0__ENABLE  0x08 ///< Differential mode is enabled on Channel 0.        
                                                                                               
