mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define PWMCFG1_DIFFMODE1__BMASK   0x10 ///< Channel 1 Differential Mode                       
#define PWMCFG1_DIFFMODE1__SHIFT   0x04 ///< Channel 1 Differential Mode                       
#define PWMCFG1_DIFFMODE1__DISABLE 0x00 ///< Differential mode is disabled on Channel 1.       
#define PWMCFG1_DIFFMODE1__ENABLE  0x10 ///< Differential mode is enabled on Channel 1.        
                                                                                               
#define PWMCFG1_DIFFMODE2__BMASK   0x20 ///< Channel 2 Differential Mode                       
#define PWMCFG1_DIFFMODE2__SHIFT   0x05 ///< Channel 2 Differential Mode                       
#define PWMCFG1_DIFFMODE2__DISABLE 0x00 ///< Differential mode is disabled on Channel 2.       
#define PWMCFG1_DIFFMODE2__ENABLE  0x20 ///< Differential mode is enabled on Channel 2.        
                                                                                               
#define PWMCFG1_DTIEN__BMASK       0x40 ///< DTI Enable                                        
#define PWMCFG1_DTIEN__SHIFT       0x06 ///< DTI Enable                                        
#define PWMCFG1_DTIEN__DISABLE     0x00 ///< No dead time will be added.                       
#define PWMCFG1_DTIEN__ENABLE      0x40 ///< Dead time will be added to all enabled            
                                        ///< differential channels per the values in the       
                                        ///< PWMDTINLIM and PWMDTIPLIM registers.              
                                                                                               
//------------------------------------------------------------------------------
// PWMCFG2 Enums (PWM Configuration 2 @ 0xD1)
//------------------------------------------------------------------------------
#define PWMCFG2_CH0EN__BMASK     0x01 ///< Channel 0 Enable                           
#define PWMCFG2_CH0EN__SHIFT     0x00 ///< Channel 0 Enable                           
#define PWMCFG2_CH0EN__DISABLE   0x00 ///< Disable PWM Channel 0.                     
#define PWMCFG2_CH0EN__ENABLE    0x01 ///< Enable PWM Channel 0.                      
                                                                                      
#define PWMCFG2_CH1EN__BMASK     0x02 ///< Channel 1 Enable                           
#define PWMCFG2_CH1EN__SHIFT     0x01 ///< Channel 1 Enable                           
#define PWMCFG2_CH1EN__DISABLE   0x00 ///< Disable PWM Channel 1.                     
#define PWMCFG2_CH1EN__ENABLE    0x02 ///< Enable PWM Channel 1.                      
                                                                                      
#define PWMCFG2_CH2EN__BMASK     0x04 ///< Channel 2 Enable                           
#define PWMCFG2_CH2EN__SHIFT     0x02 ///< Channel 2 Enable                           
#define PWMCFG2_CH2EN__DISABLE   0x00 ///< Disable PWM Channel 2.                     
#define PWMCFG2_CH2EN__ENABLE    0x04 ///< Enable PWM Channel 2.                      
                                                                                      
#define PWMCFG2_TRGSEL__FMASK    0x38 ///< External Trigger Select                    
#define PWMCFG2_TRGSEL__SHIFT    0x03 ///< External Trigger Select                    
#define PWMCFG2_TRGSEL__DISABLE  0x00 ///< PWM triggered by software setting PWMEN.   
#define PWMCFG2_TRGSEL__TMR2OF   0x08 ///< PWM triggered by Timer 2 overflow event.   
#define PWMCFG2_TRGSEL__TMR3OF   0x10 ///< PWM triggered by Timer 3 overflow event.   
#define PWMCFG2_TRGSEL__CLU2OUTA 0x18 ///< PWM triggered by CLU 2 Aysnchronous output.
#define PWMCFG2_TRGSEL__CLU3OUTA 0x20 ///< PWM triggered by CLU 3 Aysnchronous output.
                                                                                      
#define PWMCFG2_CNTRZERO__BMASK  0x80 ///< PWM counter zero                           
#define PWMCFG2_CNTRZERO__SHIFT  0x07 ///< PWM counter zero                           
#define PWMCFG2_CNTRZERO__NONE   0x00 ///< Do nothing.                                
#define PWMCFG2_CNTRZERO__ZERO   0x80 ///< Set the PWM counter to zero.               
                                                                                      
//------------------------------------------------------------------------------
// PWMCFG3 Enums (PWM Configuration 3 @ 0xDF)
//------------------------------------------------------------------------------
#define PWMCFG3_CH0XSAFST__BMASK  0x01 ///< Channel 0 X Safe State                       
#define PWMCFG3_CH0XSAFST__SHIFT  0x00 ///< Channel 0 X Safe State                       
#define PWMCFG3_CH0XSAFST__SAFE0  0x00 ///< Set CH0X's safe state to 0.                  
#define PWMCFG3_CH0XSAFST__SAFE1  0x01 ///< Set CH0X's safe state to 1.                  
                                                                                         
#define PWMCFG3_CH0YSAFST__BMASK  0x02 ///< Channel 0 Y Safe State                       
#define PWMCFG3_CH0YSAFST__SHIFT  0x01 ///< Channel 0 Y Safe State                       
#define PWMCFG3_CH0YSAFST__SAFE0  0x00 ///< Set CH0Y's safe state to 0.                  
#define PWMCFG3_CH0YSAFST__SAFE1  0x02 ///< Set CH0Y's safe state to 1.                  
                                                                                         
#define PWMCFG3_CH1XSAFST__BMASK  0x04 ///< Channel 1 X Safe State                       
#define PWMCFG3_CH1XSAFST__SHIFT  0x02 ///< Channel 1 X Safe State                       
#define PWMCFG3_CH1XSAFST__SAFE0  0x00 ///< Set CH1X's safe state to 0.                  
#define PWMCFG3_CH1XSAFST__SAFE1  0x04 ///< Set CH1X's safe state to 1.                  
                                                                                         
#define PWMCFG3_CH1YSAFST__BMASK  0x08 ///< Channel 1 Y Safe State                       
#define PWMCFG3_CH1YSAFST__SHIFT  0x03 ///< Channel 1 Y Safe State                       
#define PWMCFG3_CH1YSAFST__SAFE0  0x00 ///< Set CH1Y's safe state to 0.                  
#define PWMCFG3_CH1YSAFST__SAFE1  0x08 ///< Set CH1Y's safe state to 1.                  
                                                                                         
