mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define PWMIE_HALTIE__BMASK     0x10 ///< Halt Interrupt Enable                             
#define PWMIE_HALTIE__SHIFT     0x04 ///< Halt Interrupt Enable                             
#define PWMIE_HALTIE__DISABLE   0x00 ///< Interrupts will not be generated by a halt.       
#define PWMIE_HALTIE__ENABLE    0x10 ///< Interrupts will be generated by a halt.           
                                                                                            
//------------------------------------------------------------------------------
// PWMIF Enums (PWM Interrupt Flags @ 0x9D)
//------------------------------------------------------------------------------
#define PWMIF_CH0MATIF__BMASK   0x01 ///< Ch0 Compare Match Flag                           
#define PWMIF_CH0MATIF__SHIFT   0x00 ///< Ch0 Compare Match Flag                           
#define PWMIF_CH0MATIF__DISABLE 0x00 ///< A Channel 0 Compare Match event did not occur.   
#define PWMIF_CH0MATIF__ENABLE  0x01 ///< Set by hardware on a Channel 0 Compare Match     
                                     ///< event. Software must clear this bit.             
                                                                                           
#define PWMIF_CH1MATIF__BMASK   0x02 ///< Ch1 Compare Match Flag                           
#define PWMIF_CH1MATIF__SHIFT   0x01 ///< Ch1 Compare Match Flag                           
#define PWMIF_CH1MATIF__DISABLE 0x00 ///< A Channel 1 Compare Match event did not occur.   
#define PWMIF_CH1MATIF__ENABLE  0x02 ///< Set by hardware on a Channel 1 Compare Match     
                                     ///< event. Software must clear this bit.             
                                                                                           
#define PWMIF_CH2MATIF__BMASK   0x04 ///< Ch2 Compare Match Flag                           
#define PWMIF_CH2MATIF__SHIFT   0x02 ///< Ch2 Compare Match Flag                           
#define PWMIF_CH2MATIF__DISABLE 0x00 ///< A Channel 2 Compare Match event did not occur.   
#define PWMIF_CH2MATIF__ENABLE  0x04 ///< Set by hardware on a Channel 2 Compare Match     
                                     ///< event. Software must clear this bit.             
                                                                                           
#define PWMIF_CTROVIF__BMASK    0x08 ///< Counter Overflow Flag                            
#define PWMIF_CTROVIF__SHIFT    0x03 ///< Counter Overflow Flag                            
#define PWMIF_CTROVIF__DISABLE  0x00 ///< A Counter Overflow event did not occur.          
#define PWMIF_CTROVIF__ENABLE   0x08 ///< Set by hardware on a Counter Overflow event.     
                                     ///< Software must clear this bit.                    
                                                                                           
#define PWMIF_HALTIF__BMASK     0x10 ///< Halt Flag                                        
#define PWMIF_HALTIF__SHIFT     0x04 ///< Halt Flag                                        
#define PWMIF_HALTIF__DISABLE   0x00 ///< A kill signal has not halted the PWM.            
#define PWMIF_HALTIF__ENABLE    0x10 ///< Set by hardware when a kill signal halts the PWM.
                                     ///< Software must clear this bit.                    
                                                                                           
//------------------------------------------------------------------------------
// PWML Enums (PWM Counter LSB @ 0xC3)
//------------------------------------------------------------------------------
#define PWML_PWML__FMASK 0xFF ///< PWM Counter LSB
#define PWML_PWML__SHIFT 0x00 ///< PWM Counter LSB
                                                  
//------------------------------------------------------------------------------
// PWMLIMH Enums (PWM Counter Limit MSB @ 0xC6)
//------------------------------------------------------------------------------
#define PWMLIMH_PWMLIMH__FMASK 0xFF ///< PWM Counter Limit MSB
#define PWMLIMH_PWMLIMH__SHIFT 0x00 ///< PWM Counter Limit MSB
                                                              
//------------------------------------------------------------------------------
// PWMLIML Enums (PWM Counter Limit LSB @ 0xC5)
//------------------------------------------------------------------------------
#define PWMLIML_PWMLIML__FMASK 0xFF ///< PWM Counter Limit LSB
#define PWMLIML_PWMLIML__SHIFT 0x00 ///< PWM Counter Limit LSB
                                                              
//------------------------------------------------------------------------------
// PWMSTATUS Enums (PWM Status @ 0x9B)
//------------------------------------------------------------------------------
#define PWMSTATUS_UPDFLG0__BMASK   0x01 ///< Update Flag for Ch0                               
#define PWMSTATUS_UPDFLG0__SHIFT   0x00 ///< Update Flag for Ch0                               
#define PWMSTATUS_UPDFLG0__DISABLE 0x00 ///< Channel 0 Compare Value register has been updated 
                                        ///< with the new Compare Value Update register, or the
                                        ///< Compare Value Update register was never written   
                                        ///< to.                                               
#define PWMSTATUS_UPDFLG0__ENABLE  0x01 ///< Channel 0 Compare Value register has not been     
                                        ///< updated with the new Compare Value Update         
                                        ///< register.                                         
                                                                                               
#define PWMSTATUS_UPDFLG1__BMASK   0x02 ///< Update Flag for Ch1                               
#define PWMSTATUS_UPDFLG1__SHIFT   0x01 ///< Update Flag for Ch1                               
#define PWMSTATUS_UPDFLG1__DISABLE 0x00 ///< Channel 1 Compare Value register has been updated 
                                        ///< with the new Compare Value Update register, or the
                                        ///< Compare Value Update register was never written   
                                        ///< to.                                               
#define PWMSTATUS_UPDFLG1__ENABLE  0x02 ///< Channel 1 Compare Value register has not been     
                                        ///< updated with the new Compare Value Update         
                                        ///< register.                                         
                                                                                               
#define PWMSTATUS_UPDFLG2__BMASK   0x04 ///< Update Flag for Ch2                               
#define PWMSTATUS_UPDFLG2__SHIFT   0x02 ///< Update Flag for Ch2                               
#define PWMSTATUS_UPDFLG2__DISABLE 0x00 ///< Channel 2 Compare Value register has been updated 
                                        ///< with the new Compare Value Update register, or the
                                        ///< Compare Value Update register was never written   
                                        ///< to.                                               
#define PWMSTATUS_UPDFLG2__ENABLE  0x04 ///< Channel 2 Compare Value register has not been     
                                        ///< updated with the new Compare Value Update         
                                        ///< register.                                         
                                                                                               
