mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define SMB1CF_INH__BMASK               0x40 ///< SMBus Slave Inhibit                              
#define SMB1CF_INH__SHIFT               0x06 ///< SMBus Slave Inhibit                              
#define SMB1CF_INH__SLAVE_ENABLED       0x00 ///< Slave states are enabled.                        
#define SMB1CF_INH__SLAVE_DISABLED      0x40 ///< Slave states are inhibited.                      
                                                                                                   
#define SMB1CF_ENSMB__BMASK             0x80 ///< SMBus Enable                                     
#define SMB1CF_ENSMB__SHIFT             0x07 ///< SMBus Enable                                     
#define SMB1CF_ENSMB__DISABLED          0x00 ///< Disable the SMBus module.                        
#define SMB1CF_ENSMB__ENABLED           0x80 ///< Enable the SMBus module.                         
                                                                                                   
//------------------------------------------------------------------------------
// SMB1CN0 Enums (SMBus 1 Control @ 0x88)
//------------------------------------------------------------------------------
#define SMB1CN0_SI__BMASK           0x01 ///< SMBus Interrupt Flag                           
#define SMB1CN0_SI__SHIFT           0x00 ///< SMBus Interrupt Flag                           
#define SMB1CN0_SI__NOT_SET         0x00 ///<                                                
#define SMB1CN0_SI__SET             0x01 ///<                                                
                                                                                             
#define SMB1CN0_ACK__BMASK          0x02 ///< SMBus Acknowledge                              
#define SMB1CN0_ACK__SHIFT          0x01 ///< SMBus Acknowledge                              
#define SMB1CN0_ACK__NOT_SET        0x00 ///< Generate a NACK, or the response was a NACK.   
#define SMB1CN0_ACK__SET            0x02 ///< Generate an ACK, or the response was an ACK.   
                                                                                             
#define SMB1CN0_ARBLOST__BMASK      0x04 ///< SMBus Arbitration Lost Indicator               
#define SMB1CN0_ARBLOST__SHIFT      0x02 ///< SMBus Arbitration Lost Indicator               
#define SMB1CN0_ARBLOST__NOT_SET    0x00 ///< No arbitration error.                          
#define SMB1CN0_ARBLOST__ERROR      0x04 ///< Arbitration error occurred.                    
                                                                                             
#define SMB1CN0_ACKRQ__BMASK        0x08 ///< SMBus Acknowledge Request                      
#define SMB1CN0_ACKRQ__SHIFT        0x03 ///< SMBus Acknowledge Request                      
#define SMB1CN0_ACKRQ__NOT_SET      0x00 ///< No ACK requested.                              
#define SMB1CN0_ACKRQ__REQUESTED    0x08 ///< ACK requested.                                 
                                                                                             
#define SMB1CN0_STO__BMASK          0x10 ///< SMBus Stop Flag                                
#define SMB1CN0_STO__SHIFT          0x04 ///< SMBus Stop Flag                                
#define SMB1CN0_STO__NOT_SET        0x00 ///< A STOP is not pending.                         
#define SMB1CN0_STO__SET            0x10 ///< Generate a STOP or a STOP is currently pending.
                                                                                             
#define SMB1CN0_STA__BMASK          0x20 ///< SMBus Start Flag                               
#define SMB1CN0_STA__SHIFT          0x05 ///< SMBus Start Flag                               
#define SMB1CN0_STA__NOT_SET        0x00 ///< A START was not detected.                      
#define SMB1CN0_STA__SET            0x20 ///< Generate a START, repeated START, or a START is
                                         ///< currently pending.                             
                                                                                             
#define SMB1CN0_TXMODE__BMASK       0x40 ///< SMBus Transmit Mode Indicator                  
#define SMB1CN0_TXMODE__SHIFT       0x06 ///< SMBus Transmit Mode Indicator                  
#define SMB1CN0_TXMODE__RECEIVER    0x00 ///< SMBus in Receiver Mode.                        
#define SMB1CN0_TXMODE__TRANSMITTER 0x40 ///< SMBus in Transmitter Mode.                     
                                                                                             
#define SMB1CN0_MASTER__BMASK       0x80 ///< SMBus Master/Slave Indicator                   
#define SMB1CN0_MASTER__SHIFT       0x07 ///< SMBus Master/Slave Indicator                   
#define SMB1CN0_MASTER__SLAVE       0x00 ///< SMBus operating in slave mode.                 
#define SMB1CN0_MASTER__MASTER      0x80 ///< SMBus operating in master mode.                
                                                                                             
//------------------------------------------------------------------------------
// SMB1DAT Enums (SMBus 1 Data @ 0xBB)
//------------------------------------------------------------------------------
#define SMB1DAT_SMB1DAT__FMASK 0xFF ///< SMBus 1 Data
#define SMB1DAT_SMB1DAT__SHIFT 0x00 ///< SMBus 1 Data
                                                     
//------------------------------------------------------------------------------
// SMB1FCN0 Enums (SMBus 1 FIFO Control 0 @ 0xAD)
//------------------------------------------------------------------------------
#define SMB1FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define SMB1FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define SMB1FCN0_RXTH__ZERO      0x00 ///< RFRQ will be set anytime new data arrives in the  
                                      ///< RX FIFO (when the RX FIFO is not empty).          
                                                                                             
#define SMB1FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define SMB1FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define SMB1FCN0_RFLSH__FLUSH    0x04 ///< Initiate an RX FIFO flush.                        
                                                                                             
#define SMB1FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define SMB1FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define SMB1FCN0_RFRQE__DISABLED 0x00 ///< SMBus 1 interrupts will not be generated when RFRQ
                                      ///< is set.                                           
#define SMB1FCN0_RFRQE__ENABLED  0x08 ///< SMBus 1 interrupts will be generated if RFRQ is   
                                      ///< set.                                              
                                                                                             
