mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define SMB1FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define SMB1FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define SMB1FCN0_TXTH__ZERO      0x00 ///< TFRQ will be set when the TX FIFO is empty.       
                                                                                             
#define SMB1FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define SMB1FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define SMB1FCN0_TFLSH__FLUSH    0x40 ///< Initiate a TX FIFO flush.                         
                                                                                             
#define SMB1FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable                    
#define SMB1FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable                    
#define SMB1FCN0_TFRQE__DISABLED 0x00 ///< SMBus 1 interrupts will not be generated when TFRQ
                                      ///< is set.                                           
#define SMB1FCN0_TFRQE__ENABLED  0x80 ///< SMBus 1 interrupts will be generated if TFRQ is   
                                      ///< set.                                              
                                                                                             
//------------------------------------------------------------------------------
// SMB1FCN1 Enums (SMBus 1 FIFO Control 1 @ 0xAB)
//------------------------------------------------------------------------------
#define SMB1FCN1_RXE__BMASK     0x04 ///< RX FIFO Empty                                     
#define SMB1FCN1_RXE__SHIFT     0x02 ///< RX FIFO Empty                                     
#define SMB1FCN1_RXE__NOT_EMPTY 0x00 ///< The RX FIFO contains data.                        
#define SMB1FCN1_RXE__EMPTY     0x04 ///< The RX FIFO is empty.                             
                                                                                            
#define SMB1FCN1_RFRQ__BMASK    0x08 ///< Receive FIFO Request                              
#define SMB1FCN1_RFRQ__SHIFT    0x03 ///< Receive FIFO Request                              
#define SMB1FCN1_RFRQ__NOT_SET  0x00 ///< The number of bytes in the RX FIFO is less than or
                                     ///< equal to RXTH.                                    
#define SMB1FCN1_RFRQ__SET      0x08 ///< The number of bytes in the RX FIFO is greater than
                                     ///< RXTH.                                             
                                                                                            
#define SMB1FCN1_TXNF__BMASK    0x40 ///< TX FIFO Not Full                                  
#define SMB1FCN1_TXNF__SHIFT    0x06 ///< TX FIFO Not Full                                  
#define SMB1FCN1_TXNF__FULL     0x00 ///< The TX FIFO is full.                              
#define SMB1FCN1_TXNF__NOT_FULL 0x40 ///< The TX FIFO has room for more data.               
                                                                                            
#define SMB1FCN1_TFRQ__BMASK    0x80 ///< Transmit FIFO Request                             
#define SMB1FCN1_TFRQ__SHIFT    0x07 ///< Transmit FIFO Request                             
#define SMB1FCN1_TFRQ__NOT_SET  0x00 ///< The number of bytes in the TX FIFO is greater than
                                     ///< TXTH.                                             
#define SMB1FCN1_TFRQ__SET      0x80 ///< The number of bytes in the TX FIFO is less than or
                                     ///< equal to TXTH.                                    
                                                                                            
//------------------------------------------------------------------------------
// SMB1FCT Enums (SMBus 1 FIFO Count @ 0xF5)
//------------------------------------------------------------------------------
#define SMB1FCT_RXCNT__BMASK 0x01 ///< RX FIFO Count
#define SMB1FCT_RXCNT__SHIFT 0x00 ///< RX FIFO Count
                                                    
#define SMB1FCT_TXCNT__BMASK 0x10 ///< TX FIFO Count
#define SMB1FCT_TXCNT__SHIFT 0x04 ///< TX FIFO Count
                                                    
//------------------------------------------------------------------------------
// SMB1RXLN Enums (SMBus 1 Receive Length Counter @ 0xBC)
//------------------------------------------------------------------------------
#define SMB1RXLN_RXLN__FMASK 0xFF ///< SMBus Receive Length Counter
#define SMB1RXLN_RXLN__SHIFT 0x00 ///< SMBus Receive Length Counter
                                                                   
//------------------------------------------------------------------------------
// SMB1TC Enums (SMBus 1 Timing and Pin Control @ 0xB9)
//------------------------------------------------------------------------------
#define SMB1TC_SDD__FMASK         0x03 ///< SMBus Start Detection Window                     
#define SMB1TC_SDD__SHIFT         0x00 ///< SMBus Start Detection Window                     
#define SMB1TC_SDD__NONE          0x00 ///< No additional SDA falling edge recognition delay 
                                       ///< (0-1 SYSCLK).                                    
#define SMB1TC_SDD__ADD_2_SYSCLKS 0x01 ///< Increase SDA falling edge recognition time window
                                       ///< to 2-3 SYSCLKs after the SCL falling edge.       
#define SMB1TC_SDD__ADD_4_SYSCLKS 0x02 ///< Increase SDA falling edge recognition window to  
                                       ///< 4-5 SYSCLKs after the SCL falling edge.          
#define SMB1TC_SDD__ADD_8_SYSCLKS 0x03 ///< Increase SDA falling edge recognition window to  
                                       ///< 8-9 SYSCLKs after the SCL falling edge.          
                                                                                             
