mightymos/RF-Bridge-OB38S003/drivers/efm8bb52/inc/SI_EFM8BB52_Register_Enums.h
#define SMOD1_SDL__FMASK          0x0C ///< Data Length                                     
#define SMOD1_SDL__SHIFT          0x02 ///< Data Length                                     
#define SMOD1_SDL__5_BITS         0x00 ///< 5 bits.                                         
#define SMOD1_SDL__6_BITS         0x04 ///< 6 bits.                                         
#define SMOD1_SDL__7_BITS         0x08 ///< 7 bits.                                         
#define SMOD1_SDL__8_BITS         0x0C ///< 8 bits.                                         
                                                                                            
#define SMOD1_PE__BMASK           0x10 ///< Parity Enable                                   
#define SMOD1_PE__SHIFT           0x04 ///< Parity Enable                                   
#define SMOD1_PE__PARITY_DISABLED 0x00 ///< Disable hardware parity.                        
#define SMOD1_PE__PARITY_ENABLED  0x10 ///< Enable hardware parity.                         
                                                                                            
#define SMOD1_SPT__FMASK          0x60 ///< Parity Type                                     
#define SMOD1_SPT__SHIFT          0x05 ///< Parity Type                                     
#define SMOD1_SPT__ODD_PARITY     0x00 ///< Odd.                                            
#define SMOD1_SPT__EVEN_PARITY    0x20 ///< Even.                                           
#define SMOD1_SPT__MARK_PARITY    0x40 ///< Mark.                                           
#define SMOD1_SPT__SPACE_PARITY   0x60 ///< Space.                                          
                                                                                            
#define SMOD1_MCE__BMASK          0x80 ///< Multiprocessor Communication Enable             
#define SMOD1_MCE__SHIFT          0x07 ///< Multiprocessor Communication Enable             
#define SMOD1_MCE__MULTI_DISABLED 0x00 ///< RI will be activated after the data is received.
#define SMOD1_MCE__MULTI_ENABLED  0x80 ///< RI will be activated if the stop bits (and extra
                                       ///< bit if enabled) are 1. The extra bit must be    
                                       ///< enabled using XBE.                              
                                                                                            
//------------------------------------------------------------------------------
// UART1FCN0 Enums (UART1 FIFO Control 0 @ 0x9D)
//------------------------------------------------------------------------------
#define UART1FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define UART1FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define UART1FCN0_RXTH__ZERO      0x00 ///< RFRQ will be set anytime new data arrives in the  
                                       ///< RX FIFO (when the RX FIFO is not empty).          
                                                                                              
#define UART1FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define UART1FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define UART1FCN0_RFLSH__FLUSH    0x04 ///< Initiate an RX FIFO flush.                        
                                                                                              
#define UART1FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define UART1FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define UART1FCN0_RFRQE__DISABLED 0x00 ///< UART1 interrupts will not be generated when RFRQ  
                                       ///< is set.                                           
#define UART1FCN0_RFRQE__ENABLED  0x08 ///< UART1 interrupts will be generated if RFRQ is set.
                                                                                              
#define UART1FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define UART1FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define UART1FCN0_TXTH__ZERO      0x00 ///< TFRQ will be set when the TX FIFO is empty.       
                                                                                              
#define UART1FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define UART1FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define UART1FCN0_TFLSH__FLUSH    0x40 ///< Initiate a TX FIFO flush.                         
                                                                                              
#define UART1FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable                    
#define UART1FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable                    
#define UART1FCN0_TFRQE__DISABLED 0x00 ///< UART1 interrupts will not be generated when TFRQ  
                                       ///< is set.                                           
#define UART1FCN0_TFRQE__ENABLED  0x80 ///< UART1 interrupts will be generated if TFRQ is set.
                                                                                              
//------------------------------------------------------------------------------
// UART1FCN1 Enums (UART1 FIFO Control 1 @ 0xD8)
//------------------------------------------------------------------------------
#define UART1FCN1_RIE__BMASK       0x01 ///< Receive Interrupt Enable                          
#define UART1FCN1_RIE__SHIFT       0x00 ///< Receive Interrupt Enable                          
#define UART1FCN1_RIE__DISABLED    0x00 ///< The RI flag will not generate UART1 interrupts.   
#define UART1FCN1_RIE__ENABLED     0x01 ///< The RI flag will generate UART1 interrupts when it
                                        ///< is set.                                           
                                                                                               
#define UART1FCN1_RXTO__FMASK      0x06 ///< Receive Timeout                                   
#define UART1FCN1_RXTO__SHIFT      0x01 ///< Receive Timeout                                   
#define UART1FCN1_RXTO__DISABLED   0x00 ///< The receive timeout feature is disabled.          
#define UART1FCN1_RXTO__TIMEOUT_2  0x02 ///< A receive timeout will occur after 2 idle periods 
                                        ///< on the UART RX line.                              
#define UART1FCN1_RXTO__TIMEOUT_4  0x04 ///< A receive timeout will occur after 4 idle periods 
                                        ///< on the UART RX line.                              
#define UART1FCN1_RXTO__TIMEOUT_16 0x06 ///< A receive timeout will occur after 16 idle periods
                                        ///< on the UART RX line.                              
                                                                                               
#define UART1FCN1_RFRQ__BMASK      0x08 ///< Receive FIFO Request                              
#define UART1FCN1_RFRQ__SHIFT      0x03 ///< Receive FIFO Request                              
#define UART1FCN1_RFRQ__NOT_SET    0x00 ///< The number of bytes in the RX FIFO is less than or
                                        ///< equal to RXTH.                                    
#define UART1FCN1_RFRQ__SET        0x08 ///< The number of bytes in the RX FIFO is greater than
                                        ///< RXTH.                                             
                                                                                               
#define UART1FCN1_TIE__BMASK       0x10 ///< Transmit Interrupt Enable                         
#define UART1FCN1_TIE__SHIFT       0x04 ///< Transmit Interrupt Enable                         
#define UART1FCN1_TIE__DISABLED    0x00 ///< The TI flag will not generate UART1 interrupts.   
#define UART1FCN1_TIE__ENABLED     0x10 ///< The TI flag will generate UART1 interrupts when it
                                        ///< is set.                                           
                                                                                               
#define UART1FCN1_TXHOLD__BMASK    0x20 ///< Transmit Hold                                     
#define UART1FCN1_TXHOLD__SHIFT    0x05 ///< Transmit Hold                                     
#define UART1FCN1_TXHOLD__CONTINUE 0x00 ///< The UART will continue to transmit any available  
                                        ///< data in the TX FIFO.                              
#define UART1FCN1_TXHOLD__HOLD     0x20 ///< The UART will not transmit any new data from the  
                                        ///< TX FIFO.                                          
                                                                                               
#define UART1FCN1_TXNF__BMASK      0x40 ///< TX FIFO Not Full                                  
#define UART1FCN1_TXNF__SHIFT      0x06 ///< TX FIFO Not Full                                  
#define UART1FCN1_TXNF__FULL       0x00 ///< The TX FIFO is full.                              
#define UART1FCN1_TXNF__NOT_FULL   0x40 ///< The TX FIFO has room for more data.               
                                                                                               
#define UART1FCN1_TFRQ__BMASK      0x80 ///< Transmit FIFO Request                             
#define UART1FCN1_TFRQ__SHIFT      0x07 ///< Transmit FIFO Request                             
#define UART1FCN1_TFRQ__NOT_SET    0x00 ///< The number of bytes in the TX FIFO is greater than
                                        ///< TXTH.                                             
#define UART1FCN1_TFRQ__SET        0x80 ///< The number of bytes in the TX FIFO is less than or
                                        ///< equal to TXTH.                                    
                                                                                               
//------------------------------------------------------------------------------
// UART1FCT Enums (UART1 FIFO Count @ 0xFA)
//------------------------------------------------------------------------------
#define UART1FCT_RXCNT__FMASK 0x07 ///< RX FIFO Count
#define UART1FCT_RXCNT__SHIFT 0x00 ///< RX FIFO Count
                                                     
#define UART1FCT_TXCNT__FMASK 0x70 ///< TX FIFO Count
#define UART1FCT_TXCNT__SHIFT 0x04 ///< TX FIFO Count
                                                     
//------------------------------------------------------------------------------
// UART1LIN Enums (UART1 LIN Configuration @ 0x9E)
//------------------------------------------------------------------------------
#define UART1LIN_SYNCDIE__BMASK      0x01 ///< LIN Sync Detect Interrupt Enable                  
#define UART1LIN_SYNCDIE__SHIFT      0x00 ///< LIN Sync Detect Interrupt Enable                  
#define UART1LIN_SYNCDIE__DISABLED   0x00 ///< The SYNCD flag will not generate UART1 interrupts.
#define UART1LIN_SYNCDIE__ENABLED    0x01 ///< The SYNCD flag will generate UART1 interrupts when
                                          ///< it is set.                                        
                                                                                                 
#define UART1LIN_SYNCTOIE__BMASK     0x02 ///< LIN Sync Detect Timeout Interrupt Enable          
#define UART1LIN_SYNCTOIE__SHIFT     0x01 ///< LIN Sync Detect Timeout Interrupt Enable          
#define UART1LIN_SYNCTOIE__DISABLED  0x00 ///< The SYNCTO flag will not generate UART1           
                                          ///< interrupts.                                       
#define UART1LIN_SYNCTOIE__ENABLED   0x02 ///< The SYNCTO flag will generate UART1 interrupts    
                                          ///< when it is set.                                   
                                                                                                 
#define UART1LIN_BREAKDNIE__BMASK    0x04 ///< LIN Break Done Interrupt Enable                   
#define UART1LIN_BREAKDNIE__SHIFT    0x02 ///< LIN Break Done Interrupt Enable                   
#define UART1LIN_BREAKDNIE__DISABLED 0x00 ///< The BREAKDN flag will not generate UART1          
                                          ///< interrupts.                                       
#define UART1LIN_BREAKDNIE__ENABLED  0x04 ///< The BREAKDN flag will generate UART1 interrupts   
                                          ///< when it is set.                                   
                                                                                                 
#define UART1LIN_LINMDE__BMASK       0x08 ///< LIN Mode Enable                                   
#define UART1LIN_LINMDE__SHIFT       0x03 ///< LIN Mode Enable                                   
#define UART1LIN_LINMDE__DISABLED    0x00 ///< If AUTOBDE is set to 1, sync detection and        
                                          ///< autobaud will begin on the first falling edge of  
                                          ///< RX.                                               
#define UART1LIN_LINMDE__ENABLED     0x08 ///< A valid LIN break field and delimiter must be     
                                          ///< detected prior to the hardware state machine      
                                          ///< recognizing a sync word and performing autobaud.  
                                                                                                 
#define UART1LIN_SYNCD__BMASK        0x10 ///< LIN Sync Detect Flag                              
#define UART1LIN_SYNCD__SHIFT        0x04 ///< LIN Sync Detect Flag                              
#define UART1LIN_SYNCD__NOT_SET      0x00 ///< A sync has not been detected or is not yet        
                                          ///< complete.                                         
#define UART1LIN_SYNCD__SYNC_DONE    0x10 ///< A valid sync word was detected.                   
                                                                                                 
#define UART1LIN_SYNCTO__BMASK       0x20 ///< LIN Sync Timeout Flag                             
#define UART1LIN_SYNCTO__SHIFT       0x05 ///< LIN Sync Timeout Flag                             
#define UART1LIN_SYNCTO__NOT_SET     0x00 ///< A sync timeout has not occured.                   
#define UART1LIN_SYNCTO__TIMEOUT     0x20 ///< A sync timeout occured.                           
                                                                                                 
